Scarcha/PSD-construction-in-STM32F407G-DISC1/FFTplusMIC/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "crc.h"
#include "dma.h"
#include "i2c.h"
#include "i2s.h"
#include "pdm2pcm.h"
#include "spi.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "arm_math.h"
#include <stdint.h>
#include <string.h>
#include <math.h>
#include <stdio.h>
#include "../Components/cs43l22/cs43l22.h"
#include "../STM32F4-Discovery/stm32f4_discovery.h"
#include "filter_config.h"  // Configuración de filtros
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
enum ERROR{
	CHILL = -20,
	PDM2PCM = -21,
	CODEC = -22,
	I2S_TX = -23,
	I2S_RX = -24,
	CODEC_PLAY = -25,
	OVR = -26,
	UDR = -27,
};

enum SWITCH{
	IDLE = 0,
	FIRST_HALF = 1,
	SECOND_HALF = 2,
};

enum PSD_METHOD{
	WELCH = 0,
	BARTLETT = 1,
	PERIODOGRAM = 2,
};
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define PCM_SAMPLING_FREQ       32000U  // Frecuencia de muestreo PCM (Hz)
#define AUDIO_FREQ_PDM_HAL      64000U  // Para I2S2_BCLK ~2.048MHz -> 32kHz PCM con OSR 64
#define CS43L22_ADDRESS         0x94U   // Dirección I2C del CS43L22

// --- Configuración FFT ---
#define FFT_SIZE                1024U

// --- Canales (Según tu IOC para PDM2PCM y necesidad del CODEC) ---
#define PDM_FILTER_OUT_CHANNELS 1U      // El filtro PDM produce MONO
#define CODEC_PCM_OUT_CHANNELS  2U      // La salida al CODEC es ESTÉREO

// --- Parámetros del Filtro PDM (Basados en config. IOC y librería) ---
#define PDM_SAMPLES_PER_PDM_LIB_CALL  16  // Asumiendo PDM1_filter_config.output_samples_number = 16 (mono)
#define PDM_DECIMATION_FACTOR         64  // Asumiendo PDM1_filter_config.decimation_factor = PDM_FILTER_DEC_FACTOR_64

// --- Cálculo de Tamaños de Buffer Basados en FFT_SIZE y Config PDM ---
#define PCM_MONO_SAMPLES_PER_FFT_FRAME   FFT_SIZE // 1024 muestras MONO

#define PDM_BYTES_PER_PROCESS_CALL    (PDM_SAMPLES_PER_PDM_LIB_CALL * (PDM_DECIMATION_FACTOR / 8U)) // 16 * 8 = 128 bytes
#define NUM_PDM_PROCESS_CALLS_PER_FFT_FRAME (PCM_MONO_SAMPLES_PER_FFT_FRAME / PDM_SAMPLES_PER_PDM_LIB_CALL) // 1024 / 16 = 64 llamadas

#define PDM_RAW_INPUT_FFT_FRAME_SIZE_BYTES   (PDM_BYTES_PER_PROCESS_CALL * NUM_PDM_PROCESS_CALLS_PER_FFT_FRAME) // 128 * 64 = 8192 bytes
#define PDM_RAW_INPUT_FFT_FRAME_SIZE_UINT16  (PDM_RAW_INPUT_FFT_FRAME_SIZE_BYTES / 2U) // 4096

// Para el buffer de salida estéreo al CODEC (si el loopback sigue activo)
#define PCM_STEREO_OUTPUT_HALF_BUFFER_SIZE_UINT16  (PCM_MONO_SAMPLES_PER_FFT_FRAME * CODEC_PCM_OUT_CHANNELS) // 1024 * 2 = 2048

// --- UART ---
#define UART_BUFFER_SIZE 256 // Para formatear strings antes de enviar

// --- Para la conversión a dB ---
#define DB_FLOOR -80.0f

// --- Configuraciones de filtros importadas desde filter_config.h ---
// Las configuraciones de filtros ahora están centralizadas en filter_config.h
// para facilitar ajustes sin modificar el código principal

#define EPSILON  1e-9f

// Para Welch con overlap
#define WELCH_NUM_AVERAGES      8
#define WELCH_OVERLAP_PERCENT   50  // Overlap del 50%
#define WELCH_HOP_SIZE         (FFT_SIZE * (100 - WELCH_OVERLAP_PERCENT) / 100)  // 512 muestras
#define CIRCULAR_BUFFER_SIZE   (FFT_SIZE + WELCH_HOP_SIZE)  // 1536 muestras para manejar overlap

// Para Bartlett (sin overlap)
#define BARTLETT_NUM_AVERAGES   8  // Mismo número de promedios que Welch

// Para Periodograma (una sola ventana, sin promediado)
#define PERIODOGRAM_WINDOW_TYPE 1  // 0: Rectangular, 1: Hann, 2: Hamming

// GPIO para cambio de método (usando el botón de usuario en PA0 de la Discovery)
#define METHOD_SWITCH_GPIO_PORT GPIOA
#define METHOD_SWITCH_GPIO_PIN  GPIO_PIN_0

// Selección del método PSD inicial
#define INITIAL_PSD_METHOD      WELCH  // Método inicial al arrancar
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
arm_rfft_instance_q15 S_rfft_q15;
arm_rfft_instance_q31 S_rfft_q31;
uint32_t periodogram_cycles = 0;
uint32_t bartlett_cycles = 0;
uint32_t welch_cycles = 0;
uint32_t fft_float_cycles = 0;
uint32_t fft_q15_cycles = 0;
uint32_t fft_q31_cycles = 0;
extern PDM_Filter_Handler_t PDM1_filter_handler;
extern PDM_Filter_Config_t PDM1_filter_config;
q15_t RFFT_Input_Q15[FFT_SIZE];
q15_t RFFT_Output_Q15[FFT_SIZE];
q31_t RFFT_Input_Q31[FFT_SIZE];
q31_t RFFT_Output_Q31[FFT_SIZE];

// Buffers Ping-Pong para la entrada PDM
uint16_t pdm_raw_buffer[2][PDM_RAW_INPUT_FFT_FRAME_SIZE_UINT16];
// Buffer para la salida PCM MONO del filtro PDM
int16_t  pcm_mono_fft_input_buffer[PCM_MONO_SAMPLES_PER_FFT_FRAME];

// Buffer circular para manejar overlap en Welch
int16_t circular_pcm_buffer[CIRCULAR_BUFFER_SIZE];
uint16_t circular_buffer_write_index = 0;
uint16_t samples_in_circular_buffer = 0;

volatile uint8_t pdm_input_buffer_idx = 2; // 0: primera mitad PDM lista, 1: segunda, 2: ninguna

// Buffers y Handles para FFT
float32_t fft_input_f32[FFT_SIZE];
float32_t fft_output_f32[FFT_SIZE];
arm_rfft_fast_instance_f32 fft_instance;

