Scarcha/PSD-construction-in-STM32F407G-DISC1/FFTplusMIC/Core/Src/main.c
// Buffer para transmisión UART
char uart_tx_buffer[UART_BUFFER_SIZE];

// Ventana Hann (para Welch)
float32_t hann_window[FFT_SIZE];

// Ventanas adicionales para periodograma
float32_t hamming_window[FFT_SIZE];

// Para Welch
float32_t accumulated_psd[FFT_SIZE / 2];
uint32_t welch_frame_count = 0;

// Para Bartlett (variables adicionales)
uint32_t bartlett_frame_count = 0;

// Para Periodograma (buffer para resultados instantáneos)
float32_t periodogram_psd[FFT_SIZE / 2];

// Variables para cambio dinámico de método PSD
volatile enum PSD_METHOD current_psd_method = INITIAL_PSD_METHOD;
volatile uint8_t method_change_flag = 0;
volatile uint32_t button_debounce_time = 0;

// Variables para filtros de procesamiento de señal
#if ENABLE_DC_FILTER
static float32_t dc_filter_prev_input = 0.0f;
static float32_t dc_filter_prev_output = 0.0f;
#endif

#if ENABLE_HPF_FILTER
// Variables para filtro paso alto IIR de segundo orden
static float32_t hpf_x1 = 0.0f, hpf_x2 = 0.0f;  // Entradas previas
static float32_t hpf_y1 = 0.0f, hpf_y2 = 0.0f;  // Salidas previas
static float32_t hpf_b0, hpf_b1, hpf_b2;        // Coeficientes del numerador
static float32_t hpf_a1, hpf_a2;                // Coeficientes del denominador
#endif

#if ENABLE_PREEMPHASIS
static float32_t preemph_prev = 0.0f;
#endif

#if ENABLE_AGC
static float32_t agc_gain = 1.0f;
static float32_t agc_rms_estimate = 1000.0f;
#endif

#if ENABLE_NOTCH_FILTER
// Variables para filtro notch IIR de segundo orden
static float32_t notch_x1 = 0.0f, notch_x2 = 0.0f;  // Entradas previas
static float32_t notch_y1 = 0.0f, notch_y2 = 0.0f;  // Salidas previas
static float32_t notch_b0, notch_b1, notch_b2;      // Coeficientes del numerador
static float32_t notch_a1, notch_a2;                // Coeficientes del denominador
#endif
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void init_hann_window(void) {
    for (int i = 0; i < FFT_SIZE; i++) {
        hann_window[i] = 0.5f * (1.0f - arm_cos_f32(2.0f * PI * i / (FFT_SIZE - 1.0f)));
    }
}

void init_hamming_window(void) {
    for (int i = 0; i < FFT_SIZE; i++) {
        hamming_window[i] = 0.54f - 0.46f * arm_cos_f32(2.0f * PI * i / (FFT_SIZE - 1.0f));
    }
}

#if ENABLE_DC_FILTER
// Filtro paso alto de primer orden para eliminar DC
// y = alpha * (y_prev + x - x_prev)
float32_t apply_dc_filter(float32_t input) {
    float32_t output = DC_FILTER_ALPHA * (dc_filter_prev_output + input - dc_filter_prev_input);
    dc_filter_prev_input = input;
    dc_filter_prev_output = output;
    return output;
}

// Resetear el filtro DC cuando cambia el método
void reset_dc_filter(void) {
    dc_filter_prev_input = 0.0f;
    dc_filter_prev_output = 0.0f;
}
#endif

#if ENABLE_HPF_FILTER
// Inicializar filtro paso alto IIR de segundo orden (Butterworth)
void init_hpf_filter(void) {
    float32_t fs = (float32_t)PCM_SAMPLING_FREQ;
    float32_t fc = HPF_CUTOFF_HZ;
    float32_t w = 2.0f * PI * fc / fs;
    float32_t cos_w = arm_cos_f32(w);
    float32_t sin_w = arm_sin_f32(w);
    
    if (HPF_ORDER == 1) {
        // Filtro paso alto de primer orden
        float32_t RC = 1.0f / (2.0f * PI * fc);
        float32_t dt = 1.0f / fs;
        float32_t alpha = RC / (RC + dt);
        
        hpf_b0 = alpha;
        hpf_b1 = -alpha;
        hpf_b2 = 0.0f;
        hpf_a1 = -(alpha - 1.0f);
        hpf_a2 = 0.0f;
    } else {
        // Filtro paso alto de segundo orden (Butterworth)
        float32_t Q = 0.707f; // Factor de calidad para Butterworth
        float32_t alpha = sin_w / (2.0f * Q);
        float32_t norm = 1.0f + alpha;
        
        // Coeficientes para filtro paso alto
        hpf_b0 = (1.0f - cos_w) / (2.0f * norm);  // Para HPF: (1-cos(w))/2
        hpf_b1 = -(1.0f - cos_w) / norm;          // Para HPF: -(1-cos(w))
        hpf_b2 = (1.0f - cos_w) / (2.0f * norm);  // Para HPF: (1-cos(w))/2
        hpf_a1 = -2.0f * cos_w / norm;            // Igual para ambos tipos
        hpf_a2 = (1.0f - alpha) / norm;           // Igual para ambos tipos
    }
    
    // Resetear estados
    hpf_x1 = hpf_x2 = hpf_y1 = hpf_y2 = 0.0f;
}

float32_t apply_hpf_filter(float32_t input) {
    float32_t output = hpf_b0 * input + hpf_b1 * hpf_x1 + hpf_b2 * hpf_x2 
                      - hpf_a1 * hpf_y1 - hpf_a2 * hpf_y2;
    
    // Actualizar estados
    hpf_x2 = hpf_x1;
    hpf_x1 = input;
    hpf_y2 = hpf_y1;
    hpf_y1 = output;
    
    return output;
}

void reset_hpf_filter(void) {
    hpf_x1 = hpf_x2 = hpf_y1 = hpf_y2 = 0.0f;
}
#endif

#if ENABLE_PREEMPHASIS
// Pre-énfasis: y[n] = x[n] - α * x[n-1]
float32_t apply_preemphasis(float32_t input) {
    float32_t output = input - PREEMPHASIS_ALPHA * preemph_prev;
    preemph_prev = input;
    return output;
}

void reset_preemphasis(void) {
    preemph_prev = 0.0f;
}
#endif

#if ENABLE_AGC
// Control automático de ganancia
float32_t apply_agc(float32_t input) {
    // Estimar RMS con suavizado exponencial
    float32_t input_squared = input * input;
    agc_rms_estimate = AGC_ALPHA * agc_rms_estimate + (1.0f - AGC_ALPHA) * input_squared;
    float32_t rms = sqrtf(agc_rms_estimate);
    
    // Calcular ganancia necesaria
    if (rms > 10.0f) {  // Evitar división por cero
        float32_t target_gain = AGC_TARGET_RMS / rms;
        agc_gain = AGC_ALPHA * agc_gain + (1.0f - AGC_ALPHA) * target_gain;
        
        // Limitar ganancia para evitar amplificación excesiva
        if (agc_gain > 10.0f) agc_gain = 10.0f;
        if (agc_gain < 0.1f) agc_gain = 0.1f;
    }
    
    return input * agc_gain;
}

void reset_agc(void) {
    agc_gain = 1.0f;
    agc_rms_estimate = 1000.0f;
}
#endif

#if ENABLE_NOTCH_FILTER
// Inicializar filtro notch IIR de segundo orden
void init_notch_filter(void) {
    float32_t fs = (float32_t)PCM_SAMPLING_FREQ;
    float32_t fc = NOTCH_FREQ_HZ;  // Frecuencia del notch
    float32_t Q = NOTCH_Q_FACTOR;  // Factor de calidad
    
    float32_t w = 2.0f * PI * fc / fs;  // Frecuencia normalizada
    float32_t cos_w = arm_cos_f32(w);
    float32_t sin_w = arm_sin_f32(w);
    float32_t alpha = sin_w / (2.0f * Q);  // Factor de anchura
    
    // Coeficientes para filtro notch (band-stop) - Implementación correcta
    float32_t norm = 1.0f + alpha;
    
    // Numerador (ceros en la frecuencia de notch)
    notch_b0 = 1.0f / norm;              // Ganancia DC = 1
    notch_b1 = -2.0f * cos_w / norm;     // Ceros complejos conjugados
    notch_b2 = 1.0f / norm;              // Simetría
    
