Scarcha/PSD-construction-in-STM32F407G-DISC1/FFTplusMIC/Core/Src/main.c
    // Denominador (polos cerca pero no en la frecuencia de notch)
    notch_a1 = -2.0f * cos_w / norm;     // Igual que b1 para notch
    notch_a2 = (1.0f - alpha) / norm;    // Controla el ancho de banda
    
    // Resetear estados
    notch_x1 = notch_x2 = notch_y1 = notch_y2 = 0.0f;
}

float32_t apply_notch_filter(float32_t input) {
    float32_t output = notch_b0 * input + notch_b1 * notch_x1 + notch_b2 * notch_x2 
                      - notch_a1 * notch_y1 - notch_a2 * notch_y2;
    
    // Actualizar estados
    notch_x2 = notch_x1;
    notch_x1 = input;
    notch_y2 = notch_y1;
    notch_y1 = output;
    
    return output;
}

void reset_notch_filter(void) {
    notch_x1 = notch_x2 = notch_y1 = notch_y2 = 0.0f;
}
#endif

// Función completa de procesamiento de señal
float32_t process_sample(float32_t input) {
    float32_t output = input;
    
    // 1. Filtro DC - eliminar offset constante (primero)
#if ENABLE_DC_FILTER
    output = apply_dc_filter(output);
#endif

    // 2. Filtro HPF - eliminar bajas frecuencias (segundo)
#if ENABLE_HPF_FILTER
    output = apply_hpf_filter(output);
#endif

    // 3. Filtro Notch - eliminar frecuencias específicas (tercero)
#if ENABLE_NOTCH_FILTER
    output = apply_notch_filter(output);
#endif

    // 4. Pre-énfasis - modificar respuesta en frecuencia (cuarto)
#if ENABLE_PREEMPHASIS
    output = apply_preemphasis(output);
#endif

    // 5. AGC - control de ganancia (siempre al final)
#if ENABLE_AGC
    output = apply_agc(output);
#endif

    return output;
}

// Función para procesar una ventana FFT con overlap (Welch)
void process_welch_window(void) {
    // Extraer una ventana del buffer circular y aplicar procesamiento completo
    for (int i = 0; i < FFT_SIZE; i++) {
        int circular_index = (circular_buffer_write_index - FFT_SIZE + i + CIRCULAR_BUFFER_SIZE) % CIRCULAR_BUFFER_SIZE;
        float32_t sample = (float32_t)circular_pcm_buffer[circular_index];
        
        // Aplicar todos los filtros de procesamiento
        sample = process_sample(sample);
        
        fft_input_f32[i] = sample * hann_window[i];
    }

    float32_t current_power_val;
    uint32_t start_fft_time;
	uint32_t end_fft_time;

    // Calcular RFFT
    start_fft_time = DWT->CYCCNT;
    arm_rfft_fast_f32(&fft_instance, fft_input_f32, fft_output_f32, 0);
    end_fft_time = DWT->CYCCNT;
    fft_float_cycles = end_fft_time - start_fft_time;


    // Bin 0 (DC)
    current_power_val = fft_output_f32[0] * fft_output_f32[0];
    accumulated_psd[0] += current_power_val;
    
    // Bins 1 a (FFT_SIZE / 2) - 1
    for (int k = 1; k < FFT_SIZE / 2; k++) {
        float32_t real_part = fft_output_f32[2*k];
        float32_t imag_part = fft_output_f32[2*k+1];
        current_power_val = (real_part * real_part) + (imag_part * imag_part);
        accumulated_psd[k] += current_power_val;
    }
    
    welch_frame_count++;
}

// Función para procesar una ventana FFT sin overlap (Bartlett)
void process_bartlett_window(int16_t* pcm_buffer) {
    // Aplicar ventana rectangular y procesamiento completo
    for (int i = 0; i < FFT_SIZE; i++) {
        float32_t sample = (float32_t)pcm_buffer[i];
        
        // Aplicar todos los filtros de procesamiento
        sample = process_sample(sample);
        
        fft_input_f32[i] = sample;
    }
    
    // Calcular RFFT
    arm_rfft_fast_f32(&fft_instance, fft_input_f32, fft_output_f32, 0);
    
    float32_t current_power_val;
    
    // Bin 0 (DC)
    current_power_val = fft_output_f32[0] * fft_output_f32[0];
    accumulated_psd[0] += current_power_val;
    
    // Bins 1 a (FFT_SIZE / 2) - 1
    for (int k = 1; k < FFT_SIZE / 2; k++) {
        float32_t real_part = fft_output_f32[2*k];
        float32_t imag_part = fft_output_f32[2*k+1];
        current_power_val = (real_part * real_part) + (imag_part * imag_part);
        accumulated_psd[k] += current_power_val;
    }
    
    bartlett_frame_count++;
}

// Función para procesar periodograma con ventana seleccionada
void process_periodogram_window(int16_t* pcm_buffer) {
    // Aplicar la ventana seleccionada y procesamiento completo
    for (int i = 0; i < FFT_SIZE; i++) {
        float32_t sample = (float32_t)pcm_buffer[i];
        
        // Aplicar todos los filtros de procesamiento
        sample = process_sample(sample);
        
        // Aplicar ventana seleccionada
        switch(PERIODOGRAM_WINDOW_TYPE) {
            case 0: // Ventana rectangular (sin ventana)
                fft_input_f32[i] = sample;
                break;
            case 1: // Ventana Hann
                fft_input_f32[i] = sample * hann_window[i];
                break;
            case 2: // Ventana Hamming
                fft_input_f32[i] = sample * hamming_window[i];
                break;
            default: // Por defecto usar rectangular
                fft_input_f32[i] = sample;
                break;
        }
    }
    
    // Calcular RFFT
    arm_rfft_fast_f32(&fft_instance, fft_input_f32, fft_output_f32, 0);
    
    float32_t current_power_val;
    
    // Bin 0 (DC)
    current_power_val = fft_output_f32[0] * fft_output_f32[0];
    periodogram_psd[0] = current_power_val;
    
    // Bins 1 a (FFT_SIZE / 2) - 1
    for (int k = 1; k < FFT_SIZE / 2; k++) {
        float32_t real_part = fft_output_f32[2*k];
        float32_t imag_part = fft_output_f32[2*k+1];
        current_power_val = (real_part * real_part) + (imag_part * imag_part);
        periodogram_psd[k] = current_power_val;
    }
}

// Función para agregar nuevas muestras al buffer circular
void add_samples_to_circular_buffer(int16_t* new_samples, uint16_t num_samples) {
    for (uint16_t i = 0; i < num_samples; i++) {
        circular_pcm_buffer[circular_buffer_write_index] = new_samples[i];
        circular_buffer_write_index = (circular_buffer_write_index + 1) % CIRCULAR_BUFFER_SIZE;
        
        if (samples_in_circular_buffer < CIRCULAR_BUFFER_SIZE) {
            samples_in_circular_buffer++;
        }
    }
}

// Función común para enviar resultados de PSD
void send_psd_results(uint32_t num_averages) {
    int uart_len = 0;
    float32_t avg_power, db_val;

    // Enviar SOF
    uart_len = sprintf(uart_tx_buffer, "SOF\r\n");
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
    uart_len = 0;

