Scarcha/PSD-construction-in-STM32F407G-DISC1/FFTplusMIC/Core/Src/main.c
    for (int k = 0; k < FFT_SIZE / 2; k++) {
        avg_power = accumulated_psd[k] / num_averages;

        if (avg_power < EPSILON) {
            db_val = DB_FLOOR;
        } else {
            db_val = 10.0f * log10f(avg_power);
            if (db_val < DB_FLOOR) {
                db_val = DB_FLOOR;
            }
        }
        uart_len += sprintf(uart_tx_buffer + uart_len, "%.2f\r\n", db_val);

        if (uart_len > (UART_BUFFER_SIZE - 20) || k == (FFT_SIZE / 2) - 1) {
            if (uart_len > 0) {
                HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
                uart_len = 0;
            }
        }
    }
    if (uart_len > 0) { // Enviar cualquier remanente
        HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
    }

    // Resetear acumuladores
    memset(accumulated_psd, 0, sizeof(accumulated_psd));
}

// Función específica para enviar resultados del periodograma (sin promediado)
void send_periodogram_results(void) {
    int uart_len = 0;
    float32_t db_val;

    // Enviar SOF
    uart_len = sprintf(uart_tx_buffer, "SOF\r\n");
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
    uart_len = 0;

    for (int k = 0; k < FFT_SIZE / 2; k++) {
        if (periodogram_psd[k] < EPSILON) {
            db_val = DB_FLOOR;
        } else {
            db_val = 10.0f * log10f(periodogram_psd[k]);
            if (db_val < DB_FLOOR) {
                db_val = DB_FLOOR;
            }
        }
        uart_len += sprintf(uart_tx_buffer + uart_len, "%.2f\r\n", db_val);

        if (uart_len > (UART_BUFFER_SIZE - 20) || k == (FFT_SIZE / 2) - 1) {
            if (uart_len > 0) {
                HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
                uart_len = 0;
            }
        }
    }
    if (uart_len > 0) { // Enviar cualquier remanente
        HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
    }
}

// Función para alternar entre métodos PSD
void toggle_psd_method(void) {
    current_psd_method = (current_psd_method + 1) % 3; // Ciclar entre 0, 1, 2
    method_change_flag = 1;
}

// Función para resetear variables según el método actual
void reset_psd_variables(void) {
    // Limpiar acumuladores comunes
    memset(accumulated_psd, 0, sizeof(accumulated_psd));
    memset(periodogram_psd, 0, sizeof(periodogram_psd));
    
    // Resetear todos los filtros de procesamiento
#if ENABLE_DC_FILTER
    reset_dc_filter();
#endif

#if ENABLE_HPF_FILTER
    reset_hpf_filter();
#endif

#if ENABLE_PREEMPHASIS
    reset_preemphasis();
#endif

#if ENABLE_AGC
    reset_agc();
#endif

#if ENABLE_NOTCH_FILTER
    reset_notch_filter();
#endif
    
    // Resetear variables específicas según el método
    switch(current_psd_method) {
        case WELCH:
            memset(circular_pcm_buffer, 0, sizeof(circular_pcm_buffer));
            welch_frame_count = 0;
            circular_buffer_write_index = 0;
            samples_in_circular_buffer = 0;
            break;
            
        case BARTLETT:
            bartlett_frame_count = 0;
            break;
            
        case PERIODOGRAM:
            // No necesita reseteo especial
            break;
    }
    
    // Enviar notificación del cambio de método por UART
    const char* method_names[] = {"WELCH", "BARTLETT", "PERIODOGRAM"};
    int uart_len = sprintf(uart_tx_buffer, "METHOD_CHANGED:%s\r\n", method_names[current_psd_method]);
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
	  uint16_t pdm_buffer_offset_uint16 = 0;
	  uint16_t pcm_mono_buffer_offset = 0;

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2S2_Init();
  MX_CRC_Init();
  MX_PDM2PCM_Init();
  MX_USART2_UART_Init();
  MX_SPI1_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */
  // Enable DWT_CYCCNT for cycle counting
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk; // Enable Trace Exception (TRCENA) bit in DEMCR register
    DWT->CYCCNT = 0;                                // Reset the cycle counter
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;            // Enable the cycle counter (CYCCNTENA) bit in DWT_CTRL register
    arm_rfft_init_q15(&S_rfft_q15, FFT_SIZE, 0, 1);
    arm_rfft_init_q31(&S_rfft_q31, FFT_SIZE, 0, 1);
  	init_hann_window();
  	init_hamming_window();

    // Inicializar FFT
    if (arm_rfft_fast_init_f32(&fft_instance, FFT_SIZE) != ARM_MATH_SUCCESS) {
        Error_Handler();
    }
    
    // Inicializar filtros de procesamiento
    int uart_len = 0;
#if ENABLE_HPF_FILTER
    init_hpf_filter();
    uart_len = sprintf(uart_tx_buffer, "HPF inicializado: fc=%.1f Hz, orden=%d\r\n", HPF_CUTOFF_HZ, HPF_ORDER);
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
#endif

#if ENABLE_NOTCH_FILTER
    init_notch_filter();
    uart_len = sprintf(uart_tx_buffer, "Filtro Notch inicializado: fc=%.1f Hz, Q=%.1f\r\n", NOTCH_FREQ_HZ, NOTCH_Q_FACTOR);
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
#endif
    
    // Inicializar variables comunes
    memset(accumulated_psd, 0, sizeof(accumulated_psd));
    memset(periodogram_psd, 0, sizeof(periodogram_psd));
    
    // Inicializar según el método seleccionado
    switch(current_psd_method) {
        case WELCH:
            memset(circular_pcm_buffer, 0, sizeof(circular_pcm_buffer));
            welch_frame_count = 0;
            circular_buffer_write_index = 0;
            samples_in_circular_buffer = 0;
            break;
            
