Scarcha/PSD-construction-in-STM32F407G-DISC1/FFTplusMIC/Core/Src/main.c
        case BARTLETT:
            bartlett_frame_count = 0;
            break;
            
        case PERIODOGRAM:
            // No necesita inicialización especial
            break;
    }
    
    // Iniciar DMA I2S2 para PDM
    if (HAL_I2S_Receive_DMA(&hi2s2, (uint16_t *)pdm_raw_buffer, PDM_RAW_INPUT_FFT_FRAME_SIZE_UINT16 * 2) != HAL_OK) {
      Error_Handler();
    }
    pdm_input_buffer_idx = 2; // Ningún buffer PDM listo
    
    // Enviar mensaje inicial del método activo
    const char* method_names[] = {"WELCH", "BARTLETT", "PERIODOGRAM"};
    uart_len = sprintf(uart_tx_buffer, "INITIAL_METHOD:%s\r\n", method_names[current_psd_method]);
    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
      uint32_t start_cycles, end_cycles;
	  // Verificar si se ha solicitado un cambio de método
	  if (method_change_flag) {
		  method_change_flag = 0;
		  reset_psd_variables();
	  }
	  	
	  if (pdm_input_buffer_idx != 2) { // Un buffer PDM (un frame FFT) está listo
	        uint16_t* current_pdm_input_half_ptr;

	        if (pdm_input_buffer_idx == 0) {
	          current_pdm_input_half_ptr = pdm_raw_buffer[0];
	        } else { // pdm_input_buffer_idx == 1
	          current_pdm_input_half_ptr = pdm_raw_buffer[1];
	        }

	        //  Convertir el frame PDM completo a PCM MONO en pcm_mono_fft_input_buffer
	        pdm_buffer_offset_uint16 = 0;
	        pcm_mono_buffer_offset = 0;
	        for (int i = 0; i < NUM_PDM_PROCESS_CALLS_PER_FFT_FRAME; i++) {
	          if (MX_PDM2PCM_Process(
	                  current_pdm_input_half_ptr + pdm_buffer_offset_uint16,
	                  (uint16_t*)(pcm_mono_fft_input_buffer + pcm_mono_buffer_offset)
	               ) != 0) {
	          }
	          pdm_buffer_offset_uint16 += (PDM_BYTES_PER_PROCESS_CALL / 2U);
	          pcm_mono_buffer_offset += PDM_SAMPLES_PER_PDM_LIB_CALL;
	        }

	        // Procesar según el método seleccionado dinámicamente
	        switch(current_psd_method) {
	            case WELCH: {
                    if (welch_frame_count == 0) {
                        start_cycles = DWT->CYCCNT;
                    }
	                // Agregar las nuevas muestras al buffer circular
	                add_samples_to_circular_buffer(pcm_mono_fft_input_buffer, PCM_MONO_SAMPLES_PER_FFT_FRAME);
	                
	                // Procesar ventanas con overlap si tenemos suficientes muestras
	                if (samples_in_circular_buffer >= FFT_SIZE) {
	                    // Verificar si podemos procesar una nueva ventana (hop_size muestras desde la última)
	                    static uint16_t samples_since_last_window = 0;
	                    samples_since_last_window += PCM_MONO_SAMPLES_PER_FFT_FRAME;
	                    
	                    if (samples_since_last_window >= WELCH_HOP_SIZE) {
	                        process_welch_window();
	                        samples_since_last_window -= WELCH_HOP_SIZE;
	                        
	                        // Enviar resultados cuando tengamos suficientes promedios
	                        if (welch_frame_count >= WELCH_NUM_AVERAGES) {
	                            send_psd_results(WELCH_NUM_AVERAGES);
	                            welch_frame_count = 0;
                                end_cycles = DWT->CYCCNT;
                                welch_cycles = end_cycles - start_cycles;
	                        }
	                    }
	                }
	                break;
	            }
	            
	            case BARTLETT: {
                    if (bartlett_frame_count == 0) { // Assuming bartlett_frame_count is reset to 0 after sending
                        start_cycles = DWT->CYCCNT;
                    }
	                // Procesar directamente la ventana completa (sin overlap)
	                process_bartlett_window(pcm_mono_fft_input_buffer);
	                
	                // Enviar resultados cuando tengamos suficientes promedios
	                if (bartlett_frame_count >= BARTLETT_NUM_AVERAGES) {
	                    send_psd_results(BARTLETT_NUM_AVERAGES);
	                    bartlett_frame_count = 0;
                        end_cycles = DWT->CYCCNT;
                        bartlett_cycles = end_cycles - start_cycles;
	                }
	                break;
	            }
	            
	            case PERIODOGRAM: {
                    start_cycles = DWT->CYCCNT;
	                // Procesar directamente la ventana con la ventana seleccionada
	                process_periodogram_window(pcm_mono_fft_input_buffer);
	                // Enviar resultados inmediatamente (sin promediado)
	                send_periodogram_results();
                    end_cycles = DWT->CYCCNT;
                    periodogram_cycles = end_cycles - start_cycles;
                    
	                break;
	            }
	            
	            default:
	                // No hacer nada si el método no es válido
	                break;
	        }

	        pdm_input_buffer_idx = 2;
	  } else{
		  HAL_Delay(1);
	  }

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */
void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
  if (hi2s->Instance == SPI2) {
    pdm_input_buffer_idx = 0;
  }
}

